tutorials/compressible/rhoPimpleFoam/RAS/annularThermalMixer/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "<constant>/caseSettings"

dimensions      [0 0 0 1 0 0 0];

internalField   uniform $/outerInlet/T;

boundaryField
{
    innerInlet
    {
        type            fixedValue;
        value           uniform $/innerInlet/T;
    }

    outerInlet
    {
        type            fixedValue;
        value           uniform $/outerInlet/T;
    }

    outlet
    {
        $/outlet/T;
    }

    staticWalls
    {
        $/wall/T;
    }

    movingWalls
    {
        $staticWalls;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}


// ************************************************************************* //
